---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroModule.Dispose
source: html/4b8b35ea-bd98-b0fd-a98b-a455ad72bd06.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.Dispose Method

Releases all resources used by the MacroModule

## Syntax (C#)
```csharp
public void Dispose()
```